# GetFunctions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaManager..::..GetFunctions Method
FormulaManager Class See Also
---
Gets list of function names supported by formula engine
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IList<string> GetFunctions()
```

Visual Basic
---
```text
Public Shared Function GetFunctions As IList(Of String)
```

Visual C++
---
```text
public:
static IList<String^>^ GetFunctions()
```

# See Also
FormulaManager Class
Autodesk.Revit.DB Namespace